const basicsTask = {
    /**
     * на вход ф-ция получает 3 числа, нужно вернуть сумму этих чисел
     */
    sum(a, b, c) {
        let sum = 0;
        //ваш код тут
        return sum;
    },
    /**
     * аргументами могут быть не только числа
     * нужно вернуть сумму только чисел
     * 
     */
    safeSum(a, b, c) {
        let sum = 0;
        //ваш код тут;
        return sum;
    },

    /**
     * на входе есть 3 числа
     * нужно найти максимальное
     */
    max(a, b, c) {
        let m = a;
        //ваш код тут
        return m;
    },
    /**
     * 
     * на входе есть 3 числа
     * нужно найти минимальное
     */
    min(a, b, c) {
        let m = a;
        //ваш код тут
        return m;
    },
    //если n целое число то вернуть true, иначе false
    isIntegerNumber(n) {

    },
    //ф-ция должна уметь округлить число n до l знаков после запятой, 1 <= l <= 10
    //roundNumber(0.66666666, 2) => 0.67
    //roundNumber(1, 1) => 1.0
    roundNumber(n, l) {

    },
    //на входе массив чисел
    //ф-ция должна вернуть массив процентовб т.е. сколько процентов занимает каждое число от общей суммы
    //percentage([1, 1]) => [0.5, 0.5]
    //percentage([1, 2, 3]) => [0.17, 0.33, 0.6]
    percentage(numbers) {

    },
};
