const loopsTasks = {
  /**
   * 
   * @param {} n - целое число
   * нужно посчитать и вернуть сумму всех чисел начиная с 1 и до n
   */
  sumFromOneToN: function (n) {

  },

  /**
   * вывести не консоль строку посимвольно всеми доступными циклами. for, for of, while, do .. while
   */
  printString(str) { },

  /**
   * на вход ф-ция получет 2 числа n, maxAttempts
   * n - максимальное число, maxAttemps - максимальное кол-во попыток угадывания
   * ф-ция генерирует псевдослучайное счисло между 1 и n
   * далее у пользователя есть maxAttemps попыток это число угадать
   * ф-ция должна запрашивать у пользователя число, через prompt
   * если пользователь угадал число - вернуть true, если все попытки использованы и число не угадано - false
   * использовать цикл do ... while
   */
  guessNumber(n, maxAttempts) { },

};
