const task0 = {
    //вернуть сумму 3х чисел
    sum(a, b, c) {
        let sum = 0;
        //ваш код тут
        return sum;
    },
    //вернуть сумму чисел, но надо учесть что аргументы могут быть не только числами, использовать оператор typeof в связке с if-else
    safeSum(a, b, c) {
        let sum = 0;
        //ваш код тут;
        return sum;
    },
    // вернуть максимальное число
    max(a, b, c) {
        let m = a;
        //ваш код тут
        return m;
    },
    //вернуть минимальное число
    min(a, b, c) {
        let m = a;
        //ваш код тут
        return m;
    }
};
